import numpy as np
import pandas as pd
from sklearn.preprocessing import PolynomialFeatures

# x = np.arange(8).reshape(4,2)
# print(x)
# print(x.shape)

#########################################################################

# x = np.arange(12).reshape(4,3)
# print(x)
# print(x.shape)

# pf = PolynomialFeatures(degree=2)  # 2차 방정식 > 3이면 3차방정식
# xp = pf.fit_transform(x)
# print(xp)
# print(xp.shape)

#########################################################################

x = np.arange(8).reshape(4,2)
print(x)
print(x.shape)

pf = PolynomialFeatures(degree=3)  # 2차 방정식 > 3이면 3차방정식
xp = pf.fit_transform(x)
print(xp)
print(xp.shape)



'''
컬럼은 x1, x2 2개
변환 전
[[0 1]
 [2 3]
 [4 5]
 [6 7]]
(4, 2)

변환 후
[[ 1.  0.  1.  0.  0.  1.]
 [ 1.  2.  3.  4.  6.  9.]
 [ 1.  4.  5. 16. 20. 25.]
 [ 1.  6.  7. 36. 42. 49.]]
(4, 6)

맨 앞 컬럼은 무조건 1이다. 1 + x1 + x2 + x1제곱 + x1*x2 +x2 제곱 
'''
'''
[[ 0  1  2]
 [ 3  4  5]
 [ 6  7  8]
 [ 9 10 11]]
(4, 3)
[[  1.   0.   1.   2.   0.   0.   0.   1.   2.   4.]
 [  1.   3.   4.   5.   9.  12.  15.  16.  20.  25.]
 [  1.   6.   7.   8.  36.  42.  48.  49.  56.  64.]
 [  1.   9.  10.  11.  81.  90.  99. 100. 110. 121.]]
(4, 10)

첫 번째 컬럼을 제거해 줘야 한다. 
1 + x1+ x2+ x3 + x1제곱 + x1x2 + x1x3 + x2제곱 + x2x3+ x3제곱
'''
'''
[[0 1] 
 [2 3] 
 [4 5] 
 [6 7]]
(4, 2)

[[  1.   0.   1.   0.   0.   1.   0.   0.   0.   1.] 
 [  1.   2.   3.   4.   6.   9.   8.  12.  18.  27.] 
 [  1.   4.   5.  16.  20.  25.  64.  80. 100. 125.] 
 [  1.   6.   7.  36.  42.  49. 216. 252. 294. 343.]]
(4, 10)
1 + x1+ x2+ x1제곱 + x1x2 + x2제곱 + x1세제곱 + x2x3

'''